In [16]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [17]:
path = '../data/origin/salary/Weekly Salary_{}_edited.csv'

In [18]:
start_year, end_year = 2014,2022
salary_df = pd.DataFrame()
for year in range(start_year, end_year+1):
    data = pd.read_csv(path.format(year))
    data['year'] = year
    salary_df = pd.concat([salary_df, data])
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4803 entries, 0 to 562
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           1252 non-null   float64
 1   Name           4803 non-null   object
 2   Position       4803 non-null   object
 3   Team           4803 non-null   object
 4   Weekly Salary  4803 non-null   int64
 5   year           4803 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 262.7+ KB

In [19]:
salary_df.head()

   Rank             Name    Position  Team  Weekly Salary  year
0   1.0  Fernando Torres     Forward   CFC         340362  2014
1   2.0     Wayne Rooney     Forward  MUFC         300000  2014
2   3.0    Sergio Aguero     Forward  MCFC         220000  2014
3   NaN       Yaya Toure  Midfielder  MCFC         220000  2014
4   5.0      Diego Costa     Forward   CFC         185000  2014

In [20]:
salary_df.describe()

              Rank  Weekly Salary         year
count  1252.000000    4803.000000  4803.000000
mean    293.690096   50847.341245  2018.462419
std     200.082608   51130.436042     2.349686
min       1.000000     100.000000  2014.000000
25%     105.000000   20000.000000  2017.000000
50%     279.500000   35000.000000  2019.000000
75%     484.000000   65000.000000  2020.000000
max     648.000000  600000.000000  2022.000000

In [21]:
salary_df.isnull().mean()

Rank             0.73933
Name             0.00000
Position         0.00000
Team             0.00000
Weekly Salary    0.00000
year             0.00000
dtype: float64

In [22]:
salary_df[salary_df[['Position']].isnull().any(axis=1)]

Empty DataFrame
Columns: [Rank, Name, Position, Team, Weekly Salary, year]
Index: []

In [23]:
salary_df['Name'] = salary_df['Name'].apply(lambda n: n.strip())

In [24]:
salary_df[salary_df.Name=='Theo Walcott']

     Rank          Name Position Team  Weekly Salary  year
29    NaN  Theo Walcott  Forward  AFC         100000  2014
20    NaN  Theo Walcott  Forward  AFC         140000  2015
20    NaN  Theo Walcott  Forward  AFC         140000  2016
195   NaN  Theo Walcott  Forward  EFC          50000  2017
72    NaN  Theo Walcott  Forward  EFC         100000  2018
73    NaN  Theo Walcott  Forward  EFC         100000  2019
137   NaN  Theo Walcott  Forward  SFC          75000  2021
172   NaN  Theo Walcott  Forward  SFC          75000  2022

In [25]:
salary_df.head()

   Rank             Name    Position  Team  Weekly Salary  year
0   1.0  Fernando Torres     Forward   CFC         340362  2014
1   2.0     Wayne Rooney     Forward  MUFC         300000  2014
2   3.0    Sergio Aguero     Forward  MCFC         220000  2014
3   NaN       Yaya Toure  Midfielder  MCFC         220000  2014
4   5.0      Diego Costa     Forward   CFC         185000  2014

In [26]:
salary_df = salary_df.fillna(method='ffill')
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4803 entries, 0 to 562
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Rank           4803 non-null   float64
 1   Name           4803 non-null   object
 2   Position       4803 non-null   object
 3   Team           4803 non-null   object
 4   Weekly Salary  4803 non-null   int64
 5   year           4803 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 262.7+ KB

In [27]:
salary_df.to_csv('../data/new/salary_all.csv', index=False)